const questions = [
    {
        question: '다른 사람에게 자신을 소개하는 것은 쉬운 일이에요.',
        options: ['매우 그렇지 않다', '그렇지 않다', '보통', '그렇다', '매우 그렇다'],
        type: 'EI' 
    },
    {
        question: '처음보는 아이들과도 쉽게 이야기하거나 친해지는 편이에요.',
        options: ['매우 그렇지 않다', '그렇지 않다', '보통', '그렇다', '매우 그렇다'],
        type: 'EI'
    },
    {
        question: '혼자 조용히 있거나 책을 읽는 것보다 사람들과 어울리는 게 좋아요.',
        options: ['매우 그렇지 않다', '그렇지 않다', '보통', '그렇다', '매우 그렇다'],
        type: 'EI'
    },
    {
        question: '꾸준하고 참을성 있다는 말을 자주 듣는 편이에요.',
        options: ['매우 그렇지 않다', '그렇지 않다', '보통', '그렇다', '매우 그렇다'],
        type: 'SN' 
    },
    {
        question: '손으로 직접 만지거나 하나하나 조작하는 활동을 좋아해요.',
        options: ['매우 그렇지 않다', '그렇지 않다', '보통', '그렇다', '매우 그렇다'],
        type: 'SN' 
    },
    {
        question: '새로운 일이나 활동보다는 늘상 하는 일이 좋아요.',
        options: ['매우 그렇지 않다', '그렇지 않다', '보통', '그렇다', '매우 그렇다'],
        type: 'SN'
    },
    {
        question: '끝까지 해내는 의지와 끈기가 강한 편이에요.',
        options: ['매우 그렇지 않다', '그렇지 않다', '보통', '그렇다', '매우 그렇다'],
        type: 'TF'
    },
    {
        question: '`왜`라는 질문을 자주 하는 편이에요.',
        options: ['매우 그렇지 않다', '그렇지 않다', '보통', '그렇다', '매우 그렇다'],
        type: 'TF' 
    },
    {
        question: '야단을 맞거나 벌을 받아도 눈물을 잘 보이지 않는 편이에요.',
        options: ['매우 그렇지 않다', '그렇지 않다', '보통', '그렇다', '매우 그렇다'],
        type: 'TF' 
    },
    {
        question: '계획에 따라 규칙적인 생활을 하는 편이에요.',
        options: ['매우 그렇지 않다', '그렇지 않다', '보통', '그렇다', '매우 그렇다'],
        type: 'JP'
    },
    {
        question: '학교나 친구들 모임에서 책임있는 일을 맡고 싶어요.',
        options: ['매우 그렇지 않다', '그렇지 않다', '보통', '그렇다', '매우 그렇다'],
        type: 'JP'
    },
    {
        question: '공부나 할일을 미리 해놓고 노는 것이 좋아요.',
        options: ['매우 그렇지 않다', '그렇지 않다', '보통', '그렇다', '매우 그렇다'],
        type: 'JP' 
    },
    
];

export default questions;